#pragma once
#include "Engine/HAL/SPlatform.h"

#define SEEK_ERROR		0xFFFFFFFF

struct SGenericPlatformFile
{
public:
    FILE *				m_hFile;	// File Handle
	SIZE_T				m_dwLen;	// File Size
	SIZE_T				m_dwPos;	// File Pointer

public:
    SGenericPlatformFile();

    virtual ~SGenericPlatformFile();

    //---------------------------------------------------------------------------
    // 函数:	Open
    // 功能:	打开一个文件，准备读取
    // 参数:	FileName	文件名
    // 返回:	成功返回TRUE，失败返回FALSE。
    //---------------------------------------------------------------------------
    virtual bool	Open(char* FileName) = 0;

    //---------------------------------------------------------------------------
    // 函数:	Close
    // 功能:	关闭打开的文件
    // 参数:	void
    // 返回:	void
    //---------------------------------------------------------------------------
    void		    Close();

    //---------------------------------------------------------------------------
    // 函数:	Read
    // 功能:	读取文件数据
    // 参数:	lpBuffer	读取数据存放的内存区域
    //			dwReadBytes	读取数据的字节数
    // 返回:	成功返回读取的字节数，失败返回0。
    //---------------------------------------------------------------------------
	SIZE_T		    Read(void* lpBuffer, SIZE_T dwReadBytes);

    //---------------------------------------------------------------------------
    // 函数:	Seek
    // 功能:	移动文件指针位置
    // 参数:	lDistance		移动长度
    //			dwMoveMethod	移动方法＝FILE_BEGIN，FILE_CURRENT，FILE_END
    // 返回:	成功返回指针位置，失败返回SEEK_ERROR。
    //---------------------------------------------------------------------------
	SIZE_T		    Seek(long lDistance, uint32 dwMoveMethod);

    //---------------------------------------------------------------------------
    // 函数:	Size
    // 功能:	取得文件长度
    // 参数:	void
    // 返回:	成功返回文件长度，失败返回0。
    //---------------------------------------------------------------------------
	SIZE_T		    Size();
};
